"""do_it_together"""

#ทุกคนตบมือพร้อมกันในวินาทีที่ 0
#แต่ละคนมีความถี่ในการปรบมือไม่พร้อมกัน
#ความถี่ในที่นี้คือ ปรบมือ 1 ครั้งทุก ๆ n วินาที
#จะตบมือพร้อมอีกทีเมื่อเวลาผ่านไปเท่าไร
#ถ้ามีจำนวนคนเป็น 0 หรือ ความถี่ในการปรบมือของคนใดคนหนึ่งเป็น 0 ให้แสดงค่า 0

# input เป็น
# บรรทัดที่ 1 : จำนวนคน (จำนวนเต็มที่มากกว่าเท่ากับ 0)
# บรรทัดที่ 2 ถึง n : ความถี่ในการตบมือของแต่ละคน (จำนวนเต็มที่มากกว่าเท่ากับ 0)

# output เป็น
# บรรทัดที่ 1 : จะตบมือพร้อมอีกทีในวินาทีที่ n

# ฟังก์ชันหา ห.ร.ม.
def find_gcd(a, b):
    while b != 0:
        a, b = b, a % b
    return a

# หา ค.ร.น. จาก(num1 * num2) / ห.ร.ม.
def find_lcm(n1, n2) :
    return (n1 * n2) // find_gcd(n1, n2)

player = int(input()) #รับค่าจำนวนคนเข้ามา
sec = 1

if player == 0 : #ตรวจสอบว่า จำนวนคนเท่ากับ 0 ไหม
    sec = 0
else :
    for _ in range(player) :
        num = int(input())
        if num == 0 : #ตรวจสอบว่า ความถี่ในการตบมือเท่ากับ 0 ไหม
            sec = 0
            break
        sec = find_lcm(sec, num) #ดูว่าปรบมือพร้อมกันอีกทีในวินาทีที่เท่าไหร่ โดยใช้ ค.ร.น.

#print คำตอบ เป็นปรบมือพร้อมกันอีกทีในวินาทีที่ sec
print(sec)
